DEBUG = True
SECRET_KEY = 'some_ha5sh_#_keyidkK'
SQLALCHEMY_DATABASE_URI = 'sqlite:///fitness.db'
SESSION_TYPE = 'filesystem'
TRAINING_LEVELS = {
    '1': 'Не занимался ранее',
    '2': 'Легкие тренировки/восстановление',
    '3': 'Регулярные средние тренировки',
    '4': 'Регулярные силовые тренировки'
                   }

BMI = {
    16: 'Выраженный дефицит массы тела',
    19: 'Недостаточная (дефицит) масса тела',
    25: 'Норма',
    30: 'Избыточная масса тела (предожирение)',
    35: 'Ожирение 1 степени',
    40: 'Ожирение 2 степени',
    100: 'Ожирение 3 степени'
}

TARGETS = ['Ноги', 'Спина', 'Грудь', 'Бицепс', 'Трицепс', 'Плечи', 'Кардио', 'Разминка', 'Пресс', 'Ягодицы']

FILTERS_LOCATION = {
    '1': 'В зале',
    '2': 'Дома',
    '3': 'Спортплощадка'
            }

FILTERS_SEX = {
    '4': 'Для мужчин',
    '5': 'Для женщин'
}

FILTERS_INVENTORY = {
    '6': 'Без инвентаря',
    '7': 'С инвентарем'
}

FILTERS_TYPE = {
    '8': 'Силовые',
    '9': 'Разминка',
    '10': 'Кардио'
}

FILTER_LIST = [FILTERS_LOCATION, FILTERS_SEX, FILTERS_INVENTORY, FILTERS_TYPE]

GROUPS = {
        'fullbody': ['Разминка', 'Ноги', 'Спина', 'Грудь'],
        'cardio': ['Кардио'],
        'warming':['Разминка'],
        'split1': ['Разминка', 'Ноги', 'Плечи'],
        'split2': ['Разминка', 'Грудь', 'Трицепс'],
        'split3': ['Разминка', 'Спина', 'Бицепс'],
        'split4': ['Разминка', 'Плечи'],
        'split7': ['Разминка', 'Бицепс', 'Трицепс','Плечи'],
        'split2_1': ['Разминка', 'Ноги', 'Плечи', 'Бицепс'],
        'split2_2': ['Разминка', 'Спина', 'Грудь', 'Трицепс'],
        'Legs':['Ноги'],
        'legs_glutes': ['Ноги', 'Ягодицы']
          }
